#viselica01
def myIst():
    print('''             ╭━━━━╮╲╱╭━━━━╮
             ┃╲╲╲╲┃╭╮┃╱╱╱╱┃
             ╰┈┈┈┈┃┣┫┃┈┈┈┈╯
             ╭╯╱╱╱┃┃┃┃╲╲╲╰╮
             ┃╱╱╱╱┃┃┃┃╲╲╲╲┃
             ╰━━━━╯╰╯╰━━━━╯ ****ДОБРО ПОЖАЛОВАТЬ В ИГРУ ВИСЕЛИЦА**** ╭━━━━╮╲╱╭━━━━╮
                                                                     ┃╲╲╲╲┃╭╮┃╱╱╱╱┃
                                                                     ╰┈┈┈┈┃┣┫┃┈┈┈┈╯
                                                                     ╭╯╱╱╱┃┃┃┃╲╲╲╰╮
                                                                     ┃╱╱╱╱┃┃┃┃╲╲╲╲┃
                                                                     ╰━━━━╯╰╯╰━━━━╯''')
    print()
    print('''                                  версия данной игры 1.1                         ''')
    
myIst()
import random
def sozV():
    HANGMAN_PICS = ['''
  +---+
      |
      |
      |
     ===''','''
  +---+
  0   |
      |
      |
     ===''','''
  +---+
  0   |
  |   |
      |
     ===''','''
  +---+
  0   |
 /|   |
      |
     ===''','''
  +---+
  0   |
 /|\  |
      |
     ===''','''
  +---+
  0   |
 /|\  |
 /    |
     ===''','''
  +---+
  0   |
 /|\  |
 / \  |
     ===''','''
  +---+
 [0   |
 /|\  |
 / \  |
     ===''','''
  +---+
 [0]  |
 /|\  |
 / \  |
     ===''','''
  +---+
 [0]  |
[/|\  |
 / \  |
     ===''','''
  +---+
 [0]  |
[/|\] |
 / \  |
     ===''']
    return HANGMAN_PICS
     
words = { 'животные':'аист акула бабуин баран барсук бобр бык верблюд волк воробей ворон выдра голубь гусь жаба зебра змея индюк кит кобра коза козел койот корова кошка кролик крыса курица лама лебедь лев лиса лосось лось лягушка медведь моллюск